In [1]:
import numpy as np
import pandas as pd

In [2]:
df = pd.read_csv('archive/payment.csv')

df.head()

       date  hour   menu  price
0  20221129    13   딸기라떼   4000
1  20221130    12   카페라떼   3000
2  20221201    14  바닐라라떼   3500
3  20221201    16   초코라떼   3500
4  20221202    17   모카라떼   3500

In [4]:
df['date'] = pd.to_datetime(df['date'], format='%Y%m%d')

df.head()

        date  hour   menu  price
0 2022-11-29    13   딸기라떼   4000
1 2022-11-30    12   카페라떼   3000
2 2022-12-01    14  바닐라라떼   3500
3 2022-12-01    16   초코라떼   3500
4 2022-12-02    17   모카라떼   3500

In [5]:
sum(df['date'].dt.month == 12)

11